// задача 2 HARD необязательная. Считается за четыре обязательных ) 
// то есть три этих и одна с будущего семинара
// Сгенерировать массив случайных целых чисел размерностью 
// m*n (размерность вводим с клавиатуры) , причем чтоб количество элементов было четное. 
// Вывести на экран красивенько таблицей. Перемешать случайным образом элементы массива, 
// причем чтобы каждый элемент гарантированно и только один раз переместился на другое 
// место и выполнить перемешивание за m*n / 2 итераций. То есть если массив три на четыре, 
// то надо выполнить не более 6 итераций. И далее в конце опять вывести на экран как таблицу.